In [3]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range("20130101", periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))

In [17]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test", "train","test", "train"]),
        "F": "foo",
    }
)

In [20]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [22]:
df.head()

                   A         B         C         D
2013-01-01 -1.069837 -0.089332  0.881143  1.414471
2013-01-02 -0.074109  1.786336  0.741274  0.220150
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899

In [23]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841

In [24]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [26]:
df.to_numpy()

array([[-1.06983714, -0.08933239,  0.88114264,  1.41447126],
       [-0.0741095 ,  1.78633628,  0.74127369,  0.22015029],
       [ 0.76709822, -1.11984763,  0.69168202,  1.19093373],
       [-0.48443838,  0.07471676,  2.22911226,  0.64848032],
       [ 0.39328342,  0.55661606,  1.07593803, -2.09989879],
       [-0.59752887, -0.786346  ,  1.00391523, -2.32484121]])

In [27]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [28]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [29]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.177589  0.070357  1.103844 -0.158451
std    0.677591  1.035092  0.570600  1.646321
min   -1.069837 -1.119848  0.691682 -2.324841
25%   -0.569256 -0.612093  0.776241 -1.519887
50%   -0.279274 -0.007308  0.942529  0.434315
75%    0.276435  0.436141  1.057932  1.055320
max    0.767098  1.786336  2.229112  1.414471

In [30]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.069837   -0.074109    0.767098   -0.484438    0.393283   -0.597529
B   -0.089332    1.786336   -1.119848    0.074717    0.556616   -0.786346
C    0.881143    0.741274    0.691682    2.229112    1.075938    1.003915
D    1.414471    0.220150    1.190934    0.648480   -2.099899   -2.324841

In [31]:
df.sort_index()

                   A         B         C         D
2013-01-01 -1.069837 -0.089332  0.881143  1.414471
2013-01-02 -0.074109  1.786336  0.741274  0.220150
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841

In [32]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.414471  0.881143 -0.089332 -1.069837
2013-01-02  0.220150  0.741274  1.786336 -0.074109
2013-01-03  1.190934  0.691682 -1.119848  0.767098
2013-01-04  0.648480  2.229112  0.074717 -0.484438
2013-01-05 -2.099899  1.075938  0.556616  0.393283
2013-01-06 -2.324841  1.003915 -0.786346 -0.597529

In [33]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841
2013-01-01 -1.069837 -0.089332  0.881143  1.414471
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899
2013-01-02 -0.074109  1.786336  0.741274  0.220150

In [34]:
df["A"]

2013-01-01   -1.069837
2013-01-02   -0.074109
2013-01-03    0.767098
2013-01-04   -0.484438
2013-01-05    0.393283
2013-01-06   -0.597529
Freq: D, Name: A, dtype: float64

In [35]:
df.A

2013-01-01   -1.069837
2013-01-02   -0.074109
2013-01-03    0.767098
2013-01-04   -0.484438
2013-01-05    0.393283
2013-01-06   -0.597529
Freq: D, Name: A, dtype: float64

In [36]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.069837 -0.089332  0.881143  1.414471
2013-01-02 -0.074109  1.786336  0.741274  0.220150
2013-01-03  0.767098 -1.119848  0.691682  1.190934

In [37]:
df.loc[dates[0]]

A   -1.069837
B   -0.089332
C    0.881143
D    1.414471
Name: 2013-01-01 00:00:00, dtype: float64

In [38]:
dates[0]

Timestamp('2013-01-01 00:00:00')

In [41]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -1.069837 -0.089332
2013-01-02 -0.074109  1.786336
2013-01-03  0.767098 -1.119848
2013-01-04 -0.484438  0.074717
2013-01-05  0.393283  0.556616
2013-01-06 -0.597529 -0.786346

In [42]:
df.loc[dates[0],"A"]

np.float64(-1.0698371375586577)

In [43]:
df.at[dates[0],"A"]

np.float64(-1.0698371375586577)

In [45]:
df.iloc[3]

A   -0.484438
B    0.074717
C    2.229112
D    0.648480
Name: 2013-01-04 00:00:00, dtype: float64

In [48]:
df.iloc[:,1]

2013-01-01   -0.089332
2013-01-02    1.786336
2013-01-03   -1.119848
2013-01-04    0.074717
2013-01-05    0.556616
2013-01-06   -0.786346
Freq: D, Name: B, dtype: float64

In [49]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-05  0.393283  0.556616  1.075938 -2.099899

In [57]:
df["A"] > 0

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [50]:
df2 = df.copy()

In [53]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [54]:
df2

                   A         B         C         D      E
2013-01-01 -1.069837 -0.089332  0.881143  1.414471    one
2013-01-02 -0.074109  1.786336  0.741274  0.220150    one
2013-01-03  0.767098 -1.119848  0.691682  1.190934    two
2013-01-04 -0.484438  0.074717  2.229112  0.648480  three
2013-01-05  0.393283  0.556616  1.075938 -2.099899   four
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841  three

In [55]:
df2[df2["E"].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03  0.767098 -1.119848  0.691682  1.190934   two
2013-01-05  0.393283  0.556616  1.075938 -2.099899  four

In [56]:
df2["E"].isin(["two","four"])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [58]:
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range("20130102", periods=6))

In [59]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [60]:
df.iat[0,1] = 0

In [69]:
np.array(5 * len(df))

array(30)

In [71]:
df2 = df.copy()

In [76]:
df2[df2 > 0] = -df2

In [77]:
df2

                   A         B         C         D
2013-01-01 -1.069837  0.000000 -0.881143 -1.414471
2013-01-02 -0.074109 -1.786336 -0.741274 -0.220150
2013-01-03 -0.767098 -1.119848 -0.691682 -1.190934
2013-01-04 -0.484438 -0.074717 -2.229112 -0.648480
2013-01-05 -0.393283 -0.556616 -1.075938 -2.099899
2013-01-06 -0.597529 -0.786346 -1.003915 -2.324841

In [78]:
df

                   A         B         C         D
2013-01-01 -1.069837  0.000000  0.881143  1.414471
2013-01-02 -0.074109  1.786336  0.741274  0.220150
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841

In [79]:
df.mean()

A   -0.177589
B    0.085246
C    1.103844
D   -0.158451
dtype: float64

In [81]:
df.mean(axis = 1)

2013-01-01    0.306444
2013-01-02    0.668413
2013-01-03    0.382467
2013-01-04    0.616968
2013-01-05   -0.018515
2013-01-06   -0.676200
Freq: D, dtype: float64

In [85]:
df.agg(lambda x: np.mean(x) * 5.6)

A   -0.994497
B    0.477377
C    6.181526
D   -0.887324
dtype: float64

In [83]:
df.transform(lambda x: x * 101.2)

                     A           B           C           D
2013-01-01 -108.267518    0.000000   89.171636  143.144491
2013-01-02   -7.499881  180.777232   75.016898   22.279210
2013-01-03   77.630340 -113.328580   69.998221  120.522494
2013-01-04  -49.025164    7.561336  225.586161   65.626208
2013-01-05   39.800282   56.329545  108.884928 -212.509757
2013-01-06  -60.469922  -79.578215  101.596221 -235.273931

In [86]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [87]:
s

0    6
1    4
2    3
3    6
4    4
5    1
6    3
7    0
8    3
9    1
dtype: int64

In [88]:
s.value_counts()

3    3
6    2
4    2
1    2
0    1
Name: count, dtype: int64

In [89]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [90]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [91]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [93]:
df = pd.DataFrame(np.random.randn(10,4))

In [98]:
df

          0         1         2         3
0  0.220731 -1.671979  1.120936  1.015667
1  1.004246 -1.515033  0.909540 -0.987910
2 -1.065309 -0.225758 -1.501479  0.053093
3  0.192774 -0.536714 -0.507076 -1.109164
4  1.193868 -0.693118 -0.825216 -0.763369
5 -0.114312  2.165406  1.346733 -3.238593
6 -0.381743 -1.411686  0.133068  0.408155
7 -0.415174  1.597966 -1.424649  1.345930
8 -0.276071 -1.148249 -1.410981  0.712611
9 -0.046487 -0.249281  1.174964  0.794470

In [95]:
pieces = [df[:3], df[3:7], df[7:]]

In [97]:
pd.concat(pieces)

          0         1         2         3
0  0.220731 -1.671979  1.120936  1.015667
1  1.004246 -1.515033  0.909540 -0.987910
2 -1.065309 -0.225758 -1.501479  0.053093
3  0.192774 -0.536714 -0.507076 -1.109164
4  1.193868 -0.693118 -0.825216 -0.763369
5 -0.114312  2.165406  1.346733 -3.238593
6 -0.381743 -1.411686  0.133068  0.408155
7 -0.415174  1.597966 -1.424649  1.345930
8 -0.276071 -1.148249 -1.410981  0.712611
9 -0.046487 -0.249281  1.174964  0.794470

In [99]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [100]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [101]:
left

   key  lval
0  foo     1
1  foo     2

In [102]:
right

   key  rval
0  foo     4
1  foo     5

In [103]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [104]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [105]:
df

     A      B         C         D
0  foo    one  0.216230  0.178733
1  bar    one  0.320949 -0.531699
2  foo    two  0.617962  1.163700
3  bar  three -0.416653 -0.375850
4  foo    two -0.745665 -0.129185
5  bar    two -2.070078  1.081303
6  foo    one  0.904567 -0.533750
7  foo  three  0.771544  2.368637

In [106]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar -2.165783  0.173755
foo  1.764638  3.048135

In [108]:
df.groupby(["A","B"]).sum()

                  C         D
A   B
bar one    0.320949 -0.531699
    three -0.416653 -0.375850
    two   -2.070078  1.081303
foo one    1.120797 -0.355017
    three  0.771544  2.368637
    two   -0.127703  1.034515

In [109]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]

In [110]:
arrays

[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
 ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [111]:
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [112]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [113]:
df2 = df[:4]

In [114]:
df2

                     A         B
first second
bar   one    -0.276610 -0.381092
      two     0.081047 -1.044203
baz   one    -0.883349  1.308167
      two     0.271007 -0.739380

In [115]:
stacked = df2.stack(future_stack=True)

In [121]:
stacked

first  second
bar    one     A   -0.276610
               B   -0.381092
       two     A    0.081047
               B   -1.044203
baz    one     A   -0.883349
               B    1.308167
       two     A    0.271007
               B   -0.739380
dtype: float64

In [128]:
stacked.unstack(1)

second        one       two
first
bar   A -0.276610  0.081047
      B -0.381092 -1.044203
baz   A -0.883349  0.271007
      B  1.308167 -0.739380

In [129]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [130]:
df

        A  B    C         D         E
0     one  A  foo -0.386466  0.587137
1     one  B  foo  2.255334 -0.397281
2     two  C  foo -1.676115  0.883286
3   three  A  bar -2.153397  0.081347
4     one  B  bar  0.452300  0.947025
5     one  C  bar -0.641302  0.525730
6     two  A  foo -1.200382 -1.060318
7   three  B  foo -0.154625 -0.028904
8     one  C  foo  0.455424  0.002242
9     one  A  bar -0.042650  0.677082
10    two  B  bar  0.828603  1.641608
11  three  C  bar  0.462757 -0.600444

In [131]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -0.042650 -0.386466
      B  0.452300  2.255334
      C -0.641302  0.455424
three A -2.153397       NaN
      B       NaN -0.154625
      C  0.462757       NaN
two   A       NaN -1.200382
      B  0.828603       NaN
      C       NaN -1.676115

In [132]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")

In [133]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='s')

In [134]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [135]:
ts.resample("5Min").sum()

2012-01-01    26605
Freq: 5min, dtype: int64

In [136]:
import matplotlib.pyplot as plt

In [137]:
plt.close("all")